using Tyuiu.SologubNV.Sprint1.Task5.V7.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #0 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #1                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #2                                                              *");
        WriteLine("* Вариант #6                                                              *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу, которая решает следующую задачу:                    *");
        WriteLine("* Определить h – полное количество часов прошедших от начала суток        *");
        WriteLine("* до того момента (в первой половине дня), когда часовая стрелка          *");
        WriteLine("*  на f градусов (0<f<360, f – вещественное число).                       *");
        WriteLine("*                                                                         *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");

        double f;
        WriteLine("Введите значение переменной f: ");
        f = Convert.ToDouble(ReadLine());

        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");

        WriteLine(ds.AngleToHoursMinutes(f));
        ReadLine();
    }
}