using Tyuiu.SologubNV.Sprint1.Task0.V20.Lib;
using static System.Console;

class Program
{
    static void Main(string[] args)
    {
        Title = "Спринт #0 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #1                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #0                                                              *");
        WriteLine("* Вариант #20                                                              *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу, которая вычисляет выражение 10 + 9/3                *");
        WriteLine("* И печатает результат на экране.                                         *");
        WriteLine("*                                                                         *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        WriteLine("* 10 + 9/3                                                                 ");
        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        DataService ds = new DataService();
        WriteLine(ds.Calculate());
        ReadKey();
    }
}