using Tyuiu.SologubNV.Sprint1.Task2.V6.Lib;
using static System.Console;

class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #0 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #1                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #2                                                              *");
        WriteLine("* Вариант #6                                                              *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу, которая запрашивает у пользователя исходные данные, *");
        WriteLine("*  выполняет указанные расчёты и печатает результат на экране.            *");
        WriteLine("*                                                                         *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");

        int x;
        WriteLine("Введите значение X:");
        x = Convert.ToInt32(ReadLine());

        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");

        WriteLine(ds.ConvertMToKm(x));
        ReadLine();
    }
}