using Tyuiu.SologubNV.Sprint1.Task4.V18.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #0 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #1                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #2                                                              *");
        WriteLine("* Вариант #6                                                              *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу, которая запрашивает у пользователя исходные данные, *");
        WriteLine("*  вычисляет результат по формуле и печатает его на экране.               *");
        WriteLine("*          √(3+x)                                                         *");
        WriteLine("*  Формула:------                                                         *");
        WriteLine("*           (xy)²                                                         *");
        WriteLine("*                                                                         *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");

        double x, y;
        WriteLine("Введите значение переменной x: ");
        x = Convert.ToDouble(ReadLine());
        WriteLine("Введите значение переменной y: ");
        y = Convert.ToDouble(ReadLine());

        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");

        WriteLine(ds.Calculate(x, y));
        ReadLine();
    }
}