using Tyuiu.SologubNV.Sprint1.Task1.V28.Lib;
using static System.Console;

class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #0 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #1                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #1                                                              *");
        WriteLine("* Вариант #28                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу, которая запрашивает у пользователя исходные данные, *");
        WriteLine("*  вычисляет результат по формуле (x*2)/(1+x) и печатает его на экране.   *");
        WriteLine("*                                                                         *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");

        double x;
        WriteLine("Введите значение X:");
        x = Convert.ToDouble(Console.ReadLine());
        
        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        
        WriteLine(ds.Calculate(x));
        ReadLine();
    }
}