using Tyuiu.SologubNV.Sprint1.Task7.V24.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #0 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #1                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #7                                                              *");
        WriteLine("* Вариант #24                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу, которая вычисляет математическое выражение          *");
        WriteLine("* по исходным значениям данных, вводимых пользователем.                   *");
        WriteLine("* Ответ округлите до 3 знаков после запятой.                              *");
        WriteLine("*          1+cos√(x+1)                                                    *");
        WriteLine("*      z = ---------                                                      *");
        WriteLine("*          sin(15y-4)                                                     *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        double x, y;
        WriteLine("Введите значение переменной x: ");
        x = Convert.ToDouble(ReadLine());
        WriteLine("Введите значение переменной y: ");
        y = Convert.ToDouble(ReadLine());

        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");

        WriteLine(ds.Calculate(x,y));
        ReadLine();
    }
}